{
  "backend/main.mo": "Motoko backend actor managing user profiles, directory search, conversations, messages, and call logs with authorization checks.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to related frontend files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their roles in routing, UI, hooks, and messaging logic.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling tokens.",
  "frontend/index.html": "HTML entry point defining root element and loading the main frontend script.",
  "frontend/src/App.tsx": "Main React app configuring routes, auth gating, layout, and navigation using TanStack Router.",
  "frontend/src/components/chat/MessageList.tsx": "Renders chat messages with sender labeling, timestamps, and support for both text and video message types.",
  "frontend/src/components/chat/VideoMessageCard.tsx": "Displays a video message with playback, optional text, and interactive star-rating for video content.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component providing header, navigation, and user menu based on authentication state.",
  "frontend/src/components/system/StateViews.tsx": "Provides loading, error, and empty-state UI components with optional actions.",
  "frontend/src/components/video/StarRating.tsx": "Interactive star rating component supporting half-stars, hover effects, and read‑only mode.",
  "frontend/src/components/video/VideoRecorder.tsx": "Camera-based video recorder using MediaRecorder with UI for starting/stopping recording and handling permissions.",
  "frontend/src/components/video/VideoTrimmer.tsx": "Allows trimming uploaded videos with sliders and offers export or send-to-chat actions.",
  "frontend/src/components/video/VideoUploader.tsx": "Handles selecting and validating video files before passing them to a parent component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAddConversation.ts": "Mutation hook to add a conversation via the actor and invalidate related queries on success.",
  "frontend/src/hooks/useCallHistory.ts": "Fetches call history from the actor with periodic polling and actor-aware loading state.",
  "frontend/src/hooks/useConversations.ts": "Loads user conversations from the backend, mapping IDs to UI-friendly objects and polling periodically.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile from the backend using their identity and caches it with react-query.",
  "frontend/src/hooks/useDeleteCallEntry.ts": "Provides a mutation to delete a call log entry with optimistic updates and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, exposes login/logout, and restores identities via an auth client.",
  "frontend/src/hooks/useProfileMutations.ts": "Defines mutations to create and update user profiles and handles related cache invalidation and error messaging.",
  "frontend/src/hooks/useRemoveConversation.ts": "Supplies a mutation to remove a conversation and refreshes related queries with error‑specific toasts.",
  "frontend/src/hooks/useSendMessage.ts": "Provides a mutation to send a message to a conversation and invalidates message and conversation caches.",
  "frontend/src/hooks/useThemePreference.ts": "Stores and applies per‑user theme presets, syncing selections to localStorage and CSS variables.",
  "frontend/src/hooks/useThreadMessages.ts": "Fetches and maps backend messages for a conversation, polling periodically for updates.",
  "frontend/src/hooks/useUserProfile.ts": "Loads a public user profile for a given principal and formats it for UI use.",
  "frontend/src/hooks/useUserSearch.ts": "Searches for users matching a query string and returns mapped results when at least three characters are provided.",
  "frontend/src/hooks/useVideoRating.ts": "Retrieves mocked video rating data and provides a mutation to set ratings with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes including custom accent colors.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ActiveCallPage.tsx": "Implements an active call UI with simulated connection state, video placeholders, timers, and call controls.",
  "frontend/src/pages/CallsPage.tsx": "Displays recent call history with filtering, formatting, deletion, and navigation to start new calls.",
  "frontend/src/pages/ChatsPage.tsx": "Lists user conversations with metadata, navigation, and options to remove conversations.",
  "frontend/src/pages/ChatThreadPage.tsx": "Shows a scrolling chat thread, loads and sends messages, and manages auto‑scroll and participant display.",
  "frontend/src/pages/DirectoryPage.tsx": "Provides user search with validation and allows starting new chats or calls from search results.",
  "frontend/src/pages/HandleOnboardingPage.tsx": "Renders onboarding form for creating a user profile with username/display name validation and submission.",
  "frontend/src/pages/IncomingCallPage.tsx": "Displays an incoming call screen allowing users to accept or decline a call based on callId.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI for updating profile info and theme preferences, syncing form state with current user data.",
  "frontend/src/pages/UserProfilePage.tsx": "Shows another user's profile and enables starting a chat or call after loading their data.",
  "frontend/src/pages/VideoStudioPage.tsx": "Implements a tabbed interface for recording, uploading, and editing videos using shared video components.",
  "frontend/src/utils/conversationMeta.ts": "Utility functions for creating, parsing, validating, and labeling conversation IDs based on principals.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, container settings, extended animations, and plugin integration.",
  "project_state.json": "JSON snapshot of project requirements, features, issues, and overall app goals for messaging, calling, video tools, and theming."
}