{
  "kind": "build_request",
  "title": "Fix non-working Chat button when starting a conversation from Directory",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Fix starting a new chat from the Directory so the Chat button successfully creates (or reuses) the 1:1 conversation and navigates into the chat thread.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "when I try to chat with someone, the chat button doesn't work, so please fix that"
        ]
      },
      "acceptanceCriteria": [
        "On the Directory page, search results provide a valid target principal value for each user, so the Chat button is not disabled due to missing principal data.",
        "Clicking Chat on a Directory search result calls the backend to add the derived conversationId (from current user principal + target principal) and then navigates to /chats/$conversationId.",
        "If the conversation already exists, clicking Chat still navigates to the existing thread without error.",
        "If starting the chat fails, the user sees a clear error toast/message in English (and the app does not silently fail)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Update the backend user search API so search results include the user Principal along with username and displayName, eliminating the current frontend workaround that returns an empty principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "the chat button doesn't work"
        ]
      },
      "acceptanceCriteria": [
        "The backend exposes a query search API used by the frontend that returns entries containing: principal (as text or Principal), username, and displayName for each matched user profile.",
        "Directory search continues to enforce the existing minimum search length rule (>= 3 characters) and returns matches by username or displayName.",
        "No existing canister state is lost; this change is additive and does not require a data migration."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Update the frontend user search hook and Directory page to use the backend-provided principal in search results so the Chat button works reliably.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "the chat button doesn't work"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/hooks/useUserSearch.ts no longer returns principal: '' for results; it maps principal from the backend response.",
        "frontend/src/pages/DirectoryPage.tsx uses the principal from search results when building the conversationId and when enabling/disabling the Chat button.",
        "Directory search results no longer show users with missing principal; if a result lacks a principal unexpectedly, the Chat button remains disabled and an error is logged (or surfaced) rather than navigating to a broken route."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with logic in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing real-time updates via WebSockets.",
    "Adding new chat features beyond fixing the broken chat initiation flow (e.g., group chats, read receipts).",
    "Third-party authentication providers (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}