{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Directory chat initiation by using backend principals and robust navigation/error handling",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Make the Directory Chat button reliably create/reuse the 1:1 conversation and navigate into the chat thread with clear error feedback.",
      "acceptanceCriteria": [
        "On the Directory page, search results provide a valid target principal value for each user, so the Chat button is not disabled due to missing principal data.",
        "Clicking Chat on a Directory search result calls the backend to add the derived conversationId (from current user principal + target principal) and then navigates to /chats/$conversationId.",
        "If the conversation already exists, clicking Chat still navigates to the existing thread without error.",
        "If starting the chat fails, the user sees a clear error toast/message in English (and the app does not silently fail)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DirectoryPage.tsx",
          "operation": "modify",
          "description": "Harden the chat initiation flow: validate the target principal before enabling Chat; when Chat is clicked, derive the conversationId from current principal + target principal, attempt to add the conversation, and navigate to /chats/$conversationId. If adding fails, attempt a safe fallback (e.g., confirm the conversation exists) and still navigate when appropriate; otherwise show a clear English toast/message instead of silently failing."
        },
        {
          "path": "frontend/src/hooks/useAddConversation.ts",
          "operation": "modify",
          "description": "Ensure add-conversation failures produce a clear, user-visible English toast/message and propagate enough error context for DirectoryPage to decide whether it can still navigate to an existing thread."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Update the user search hook and Directory page to use backend-provided principals and avoid broken navigation when principal data is missing.",
      "acceptanceCriteria": [
        "frontend/src/hooks/useUserSearch.ts no longer returns principal: '' for results; it maps principal from the backend response.",
        "frontend/src/pages/DirectoryPage.tsx uses the principal from search results when building the conversationId and when enabling/disabling the Chat button.",
        "Directory search results no longer show users with missing principal; if a result lacks a principal unexpectedly, the Chat button remains disabled and an error is logged (or surfaced) rather than navigating to a broken route."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useUserSearch.ts",
          "operation": "modify",
          "description": "Switch the hook to use the backend directory search capability that returns principals, and map the returned principal into the hook result type (as a string). Remove the workaround that returns an empty principal and keep the existing minimum search length rule (>= 3 characters)."
        },
        {
          "path": "frontend/src/pages/DirectoryPage.tsx",
          "operation": "modify",
          "description": "Consume the updated useUserSearch results and ensure results without a valid principal are not shown; if a missing/invalid principal is encountered unexpectedly, keep Chat disabled and log/surface an error instead of navigating to a broken /chats route."
        },
        {
          "path": "frontend/src/utils/conversationMeta.ts",
          "operation": "modify",
          "description": "Reuse/extend existing principal validation utilities (e.g., isValidPrincipal) as needed by DirectoryPage to reliably enable/disable Chat and prevent invalid conversationId generation."
        }
      ]
    }
  ]
}